; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob66) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate0)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot1)
	(clear crate2)
	(at pallet7 depot2)
	(clear pallet7)
	(at pallet8 depot1)
	(clear crate4)
	(at pallet9 distributor2)
	(clear crate1)
	(at pallet10 distributor2)
	(clear pallet10)
	(at truck0 depot0)
	(at truck1 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at hoist7 depot1)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at crate0 distributor1)
	(on crate0 pallet4)
	(at crate1 distributor2)
	(on crate1 pallet9)
	(at crate2 depot1)
	(on crate2 pallet6)
	(at crate3 depot1)
	(on crate3 pallet8)
	(at crate4 depot1)
	(on crate4 crate3)
)

(:goal (and
		(on crate0 pallet0)
		(on crate2 pallet8)
		(on crate3 pallet1)
		(on crate4 pallet3)
	)
))

; plan
1. (lift hoist4 crate0 pallet4 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 pallet4)
   added: (lifting hoist4 crate0) (clear pallet4)
   goals met: 0 of 4
2. (load hoist4 crate0 truck1 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck1) (available hoist4)
   goals met: 0 of 4
3. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 0 of 4
4. (unload hoist0 crate0 truck1 depot0)
   deleted: (in crate0 truck1) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 0 of 4
5. (drop hoist0 crate0 pallet0 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet0)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet0)
   goals met: 1 of 4
6. (lift hoist6 crate4 crate3 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist6) (on crate4 crate3)
   added: (lifting hoist6 crate4) (clear crate3)
   goals met: 1 of 4
7. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 1 of 4
8. (load hoist6 crate4 truck0 depot1)
   deleted: (lifting hoist6 crate4)
   added: (in crate4 truck0) (available hoist6)
   goals met: 1 of 4
9. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 1 of 4
10. (unload hoist9 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist9)
   added: (lifting hoist9 crate4)
   goals met: 1 of 4
11. (drop hoist9 crate4 pallet3 distributor0)
   deleted: (lifting hoist9 crate4) (clear pallet3)
   added: (available hoist9) (at crate4 distributor0) (clear crate4) (on crate4 pallet3)
   goals met: 2 of 4
12. (lift hoist7 crate2 pallet6 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist7) (on crate2 pallet6)
   added: (lifting hoist7 crate2) (clear pallet6)
   goals met: 2 of 4
13. (lift hoist6 crate3 pallet8 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist6) (on crate3 pallet8)
   added: (lifting hoist6 crate3) (clear pallet8)
   goals met: 2 of 4
14. (drop hoist6 crate3 pallet1 depot1)
   deleted: (lifting hoist6 crate3) (clear pallet1)
   added: (available hoist6) (at crate3 depot1) (clear crate3) (on crate3 pallet1)
   goals met: 3 of 4
15. (drop hoist7 crate2 pallet8 depot1)
   deleted: (lifting hoist7 crate2) (clear pallet8)
   added: (available hoist7) (at crate2 depot1) (clear crate2) (on crate2 pallet8)
   goals met: 4 of 4
